Tekla.Structures.Drawing.DimensionSetBaseAttributes.FrameTypes
The frame types around the dimension values.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.FrameTypes.None
No frame.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.FrameTypes.Rectangle
The frame is a rectangle.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.FrameTypes.Underline
The frame is an underline.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.FrameTypes.RoundedRectangle
The frame is a rectangle with rounded ends.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.FrameTypes.SharpenedRectangle
The frame is a rectangle with sharpened ends.